//cppファイルは#include stdafx.hを必ずソースの先頭に書いてね！！！
#include "stdafx.h"	　
#include "Background.h"
#include "Enemy.h"
#include "Food.h"
#include "Player.h"

/////////////////////////////////////////////////////
// グローバル変数
/////////////////////////////////////////////////////
//マップ定義。
int g_map[16][16] = {
	{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },	//  0列目
	{ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },	//  1列目
	{ 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },	//  2列目
	{ 1, 0, 1, 1, 2, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1 },	//  3列目
	{ 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1 },	//  4列目
	{ 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1 },	//  5列目
	{ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1 },	//  6列目
	{ 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 2, 0, 1 },	//  7列目
	{ 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1 },	//  8列目
	{ 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1 },	//  9列目
	{ 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1 },	// 10列目
	{ 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },	// 11列目
	{ 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1 },	// 12列目
	{ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },	// 13列目
	{ 1, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 1 },	// 14列目
	{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 },	// 15列目

};

//パスファイディング。
CPathFinding g_pathFinding;

//敵の数。
int g_enemyNum = 0;

//食べ物の数。
int g_foodNum = 0;

/////////////////////////////////////////////////////
// 関数
/////////////////////////////////////////////////////
/*!----------------------------------------------------
*@brief	ゲームの初期化。
----------------------------------------------------*/
void GameInitialize()
{
	//g_mapをもとに、エネミーと食べ物を初期化していく。
	for ( int x = 0; x < 16; x++ ) {
		for ( int y = 0; y < 16; y++ ) {
			if ( g_map[y][x] == 2 ) {
				//敵だよ。
				g_enemyArray[g_enemyNum].Initialyze( x, y );
				g_enemyNum++; //敵の数をインクリメント。
			}
			else if ( g_map[y][x] == 0 ) {
				//食べ物だよ。
				g_foodArray[g_foodNum].Initialyze( x, y );
				g_foodNum++;
			}
		}
	}

	//パスファインディングを初期化。
	g_pathFinding.BuildNodes();
}
/*!----------------------------------------------------
*@brief	メイン関数。
----------------------------------------------------*/
int main()
{
	//ゲームを初期化。
	GameInitialize();

	int gameClear = 0;	//ゲームクリアフラグ。
	//ここからゲームループ。
	while (true) {
		//1フレームの開始。
		kbcBeginFrame();
		// ここから ///////////////////////////////////////////////////////////
		if (gameClear == 1) { //ゲームクリア？。
			kbcDrawMojiRetu(0, 0, "げーむくりあ");
		}else if(g_player.isDead == 0){	//プレイヤーが死亡していないときの処理。
			//敵の更新。
			for (int no = 0; no < g_enemyNum; no++) {
				g_enemyArray[no].Update();
			}
			
			//プレイヤーの更新処理。
			PlayerUpdate();

			//背景を描画。
			DrawBackground();

			//食べ物の描画。
			for (int no = 0; no < g_foodNum; no++) {
				g_foodArray[no].Draw();
			}

			//敵の描画処理。
			for (int no = 0; no < g_enemyNum; no++) {
				g_enemyArray[no].Draw();
			}

			// プレイヤーの描画処理。
			PlayerDraw();
		}
		else {
			//プレイヤーが死亡しているときの処理。
			kbcDrawMojiRetu(0, 0, "げーむおーばー");
		}
		// ここまでの間にゲームのプログラムを書いていってね//////////////////////
		
		//1フレームの終了。
		kbcEndFrame();
	}

	return 0;
}