#pragma once


/////////////////////////////////////////////////////
// 定数。
/////////////////////////////////////////////////////
const int MAX_ENEMY = 100;		//敵の最大数。

/////////////////////////////////////////////////////
//敵クラスの宣言。
//クラスは変数と、操作(関数)が一つにまとまったもの。
/////////////////////////////////////////////////////
class CEnemy {
public:
	//敵の状態を表す列挙子。
	//enumは上から0,1,2と値が割り当てられます。
	//int型の定数だと考えてOKです。
	enum EnemyState {
		EnemyState_Haikai,		//0 徘徊ステート。
		EnemyState_Tuiseki,		//1 追跡ステート。
		EnemyState_Return,		//2 初期位置に戻るステート。
	};
public:
	//ここからメンバ関数。
	/*!----------------------------------------------------
	* @brief	エネミーの初期化。
	* @detail
	*   座標の更新とか、状態の更新とかを行う。
	*@param[in]	x		初期のX座標。
	*@param[in] y		初期のY座標。
	----------------------------------------------------*/
	void Initialyze(int x, int y);

	/*!----------------------------------------------------
	* @brief	エネミーの更新処理。
	* @detail
	*   座標の更新とか、状態の更新とかを行う。
	
	----------------------------------------------------*/
	void Update();

	/*!----------------------------------------------------
	* @brief	エネミーを描画。
	----------------------------------------------------*/
	void Draw();
public: 
	//ここからメンバ変数
	int posX = 0;							//X座標。
	int posY = 0;							//Y座標。
	int initPosX = 0;						//初期X座標。
	int initPosY = 0;						//初期Y座標
	EnemyState state = EnemyState_Haikai;	//敵のステート。
	int waitCount = 5;						//ウェイトカウント。
};


extern CEnemy g_enemyArray[MAX_ENEMY];	//エネミーの配列。実体はEnemy.cppにあります。

