#pragma once

/////////////////////////////////////////////////////
// 定数。
/////////////////////////////////////////////////////
const int MAX_FOOD = 512;		//食べ物の最大数。

/////////////////////////////////////////////////////
//食べ物クラスの宣言。
//クラスは変数と、操作(関数)が一つにまとまったもの。
/////////////////////////////////////////////////////
class CFood {

public:
	//ここからメンバ関数。
	/*!----------------------------------------------------
	* @brief	食べ物の初期化。
	* @detail
	*   座標の更新とか、状態の更新とかを行う。
	*@param[in]	posX		初期のX座標。
	*@param[in] posY		初期のY座標。
	----------------------------------------------------*/
	void Initialyze( int x, int y );

	/*!----------------------------------------------------
	* @brief	食べ物を描画。
	----------------------------------------------------*/
	void Draw();
public:
	//ここからメンバ変数。
	int posX = 0;		//X座標。
	int posY = 0;		//Y座標。
	int isDead = 0;		//死亡フラグ。
};

extern CFood g_foodArray[MAX_FOOD];		//食べ物の配列。実体はFood.cppにあります。

