#pragma once

/*!----------------------------------------------------
* @brief	プレイヤーの構造体。
----------------------------------------------------*/
struct SPlayer {
	int isDead = 0;	//プレイヤーの死亡フラグ。
	int posX = 7;	//プレイヤーのX座標。
	int posY = 7;	//プレイヤーのY座標。
};


extern SPlayer g_player;	//g_playerのextern宣言。本体はPlayer.cppに定義されています。

/*!----------------------------------------------------
* @brief	プレイヤーの更新処理。
* @detail
*   座標の更新とか、状態の更新とかを行う。
----------------------------------------------------*/
void PlayerUpdate();
/*!----------------------------------------------------
* @brief	プレイヤーの描画処理。
----------------------------------------------------*/
void PlayerDraw();